IDEA Open Model
IdeaConImportSettings Properties
The IdeaConImportSettings type exposes the following members.
Properties
Name | Description
CanChangeDesignCodeInWizard
 Can change design code in Wizard
ConnectionFileName
 Gets or sets the name of the Connection project
DefaultBoltAssembly
 Gets or sets the name of the default bolt assembly
DefaultSteelMaterial
 Gets or sets the name of the default material of plates which are added from the template
DefaultWeldMaterial
 Gets or sets the name of the default weld material
DesignCode
 Gets or sets the Design Code There can be : ECEN AISC CISC
ExportAllLinearCombination
 All linear combination will be exported to IDEA connection
OnePageWizard
 One page wizard
RunningApplication
 Running application
StartIdeaStaticaApp
 StartIdeaStaticaApp
UserWizardBrand
 Set user Wizard Brand
UseWizard
 Open import wizard window
WaitForExit
 WaitForExit
Top
See Also
Reference
IdeaConImportSettings Class
IdeaRS.OpenModel.Connection Namespace